module.exports.command = () => {
    let cmd = ["admin"];
    return { cmd, handler };
}
const more = String.fromCharCode(8206);
const readMore = more.repeat(4001);

const handler = async (sock, msg, from, args, msgInfoObj) => {
    let { prefix} = msgInfoObj;
    
    const admin = `
---------------------------------------------------------------
    ─「 *𝔾𝕣𝕖𝕖𝕥𝕚𝕟𝕘𝕤 ${msg.pushName}* 」─     
---------------------------------------------------------------

  𝕴'𝖒 𝕭𝖎𝖙 𝕭𝖔𝖙 𝖓𝖎𝖈𝖊 𝖙𝖔 𝖒𝖊𝖊𝖙 𝖞𝖔𝖚 :)

---------------------------------------------------------------
🅐🅓🅜🅘🅝 🅒🅞🅜🅜🅐🅝🅓 🅛🅘🅢🅣
---------------------------------------------------------------
${readMore}

*${prefix}ᴀᴅᴅ* - _ᴀᴅᴅ ᴀɴʏ ɴᴇᴡ ᴍᴇᴍʙᴇʀ!_
*${prefix}ʙᴀɴ* - _ᴋɪᴄᴋ ᴀɴʏ ᴍᴇᴍʙᴇʀ ᴏᴜᴛ ꜰʀᴏᴍ ɢʀᴏᴜᴘ!_
*${prefix}ᴘʀᴏᴍᴏᴛᴇ* - _ɢɪᴠᴇ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪꜱꜱɪᴏɴ ᴛᴏ_ 
                    _ᴀ ᴍᴇᴍʙᴇʀ!_
*${prefix}ᴅᴇᴍᴏᴛᴇ* - _ʀᴇᴍᴏᴠᴇ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪꜱꜱɪᴏɴ ᴏꜰ_ 
                    _ᴀ ᴍᴇᴍʙᴇʀ!_
*${prefix}ʀᴇɴᴀᴍᴇ* - _ᴄʜᴀɴɢᴇ ɢʀᴏᴜᴘ ꜱᴜʙᴊᴇᴄᴛ!_
*${prefix}ᴄʜᴀᴛ* - _ᴇɴᴀʙʟᴇ/ᴅɪꜱᴀʙʟᴇ ɢʀᴏᴜᴘ ᴄʜᴀᴛ_
*${prefix}ʀᴇᴍᴏᴠᴇʙᴏᴛ* - _ʀᴇᴍᴏᴠᴇ ʙᴏᴛ ꜰʀᴏᴍ ɢʀᴏᴜᴘ!_
*${prefix}ᴡᴀʀɴ* - _ɢɪᴠᴇ ᴡᴀʀɪɴɢ ᴛᴏ ᴀ ᴘᴇʀꜱᴏɴ_
*${prefix}ᴜɴᴡᴀʀɴ* - _ʀᴇᴍᴏᴠᴇ ᴡᴀʀɪɴɢ ᴛᴏ ᴀ ᴘᴇʀꜱᴏɴ_
*${prefix}ᴛᴀɢᴀʟʟ* - _ᴛᴀɢ ᴀʟʟ ᴍᴇᴍʙᴇʀꜱ_


♥ мα∂є ωιтн ℓσνє, υѕє ωιтн ℓσνє ♥️`

    sock.sendMessage(
        from,
        { text: admin }
    );
}